
# (E1_T01_P_15).  Знайдіть скільки чисел, таких, що містять принаймні одну
# з цифр 7 та 6 міститься у проміжку 50_000, 500_000.
# Відомо, що проміжок 500, 5000 містить 2260 таких чисел


# Вправа 1 !!! Знайдіть скільки чисел, таких, що містять обидві з цифр 4 та 5 міститься у проміжку 5_000, 50_000
# Вправа 2 !!! Знайдіть скільки чисел, що містяться у проміжку від 30_000 до 100_000, що містять рівно 3 рази цифру 9.
# Вправа 3 !!!
#  (E1_T01_P_02) Знайдіть скільки чисел, сума цифр яких дорівнює 23,
#  міститься у проміжку (10_000, 100_000).
#  Відомо, що проміжок (1000, 50_000) міститься 2890 таких числа.

# у цій задачі було б зручно мати функцію, яка перевіряє чи містить число задану цифру

# 8378583 - число
# 837858 3

# чи містить число N цифру k?
def is_contained(N, k):
    # return str(k) in str(N) - чітерство так не можна на іспиті!!!
    while N > 0:
        d = N % 10
        if d == k:
            return True
        N = N // 10

    return False

# _3_in_837 = is_contained(837, 3)
# print(_3_in_837)
# _5_in_837 = is_contained(837, 5)
# print(_5_in_837)

# print(is_contained(8378583, 7))  # True
# print(is_contained(8378583, 6))  # False
# print(is_contained(3333, 0))     # False
# print(is_contained(33303, 0))    # True
#
counter = 0
for i in range(500, 5000):
    if is_contained(i, 7) or is_contained(i, 6):
        counter += 1

print(counter)