# Найбільший спільний дільник двох натуральних чисел

# n     m     n % m
# 12    15
# 15    12  # сортуємо змінні, так, щоб в n було більше число ніж в m
# 15 %  12  = 3
# 12 %  3   = 0
# 3     0

# 7     5
# 7  %  5  =  2
# 5  %  2  =  1
# 2  %  1  =  0
# 1     0

n, m = map(int, input().split())  # n, m = [int(el) for el in input().split()]

if n < m:  # сортуємо змінні, так, щоб в n було більше число ніж в m
    d = n
    n = m
    m = d

while m > 0:
    ost = n % m
    n = m
    m = ost


print(f"НСД = {n}")





