# Чи є введене з клавіатури натуральне число N простим

N = int(input("Задайте натуральне число N (>= 2) "))

# отже, щоб перервірити чи є число простим, треба спробувати поділити
# його на ціло на всі числа від 2 до N-1, якщо хоч на якесь поділить
# N без остачі, то N просте

i = 2
is_prime = True  # спочатку вважаємо, що число є простим
while i <= N-1:
    # print(i)
    if N % i == 0:  # якщо поділилося без остачі,
        is_prime = False  # то число не просте
        break

    i += 1   # i = i + 1

print(F"Число {N} просте = {is_prime}")
