# Чи є введене з клавіатури натуральне число N простим

N = int(input("Задайте натуральне число N (>= 2) "))

# отже, щоб перервірити чи є число простим, треба спробувати поділити
# його на ціло на всі числа від 2 до N-1, якщо хоч на якесь поділить
# N без остачі, то N просте

i = 2
while i <= N-1:
    if N % i == 0:  # якщо поділилося без остачі,
        print(f"Число {N} не є простим")
        break

    i += 1   # i = i + 1
else: # спрацьовує якщо цикл завершився природнім чином, тобто БЕЗ виконання оператора break
    print(f"Число {N} є простим")

