# Нехай є список, потрібно перевірити, чи він є симетричним
# [1, 2, 3, 2, 4]

lst = [1, 2, 3, 2, 2, 1]
# lst = [1, 2, 3, 2, 1]
# lst = [1, 2, 3, 222,   4, 34, 12]
#      0  1  2  3(-4) -3  -2  -1
# print(lst)

# for el in lst: # обхід списку по елементах
#     print(el)

# for i in range(len(lst)): # обхід списку по індексах
#     print(i, lst[i])

for i in range(len(lst) // 2):
    if lst[i] != lst[- 1 - i]:
        print("Список не симетричний")
        break
else:
    print("Список симетричний")

