lst = [1, 2, 3, 2,  5,  2,  1, 23, 12, 77]
#      0  1  2  3   4   5   6  7   8   9
#                             -3  -2   -1

# print(lst[2:5:1])
# print(lst[1:8:3])

# print(lst[1:8:1])
# print(lst[1:8])  # якщо step == 1, можна крок не вказувати

# print(lst[6:len(lst)])
# print(lst[6:])  # якщо треба зробити зріз до кінця списку, то праву межу можна опустити, але не опустити ":"

# print(lst[4:len(lst)-3])
# print(lst[4: -3])

# print(lst[0:5])
# print(lst[ :5])  # якщо зріз з нульового елементу, то 0 можна опустити

# print(lst[:])  # зріз, що будує копію списку
####### переконуємося, що зріз будує саме копію
# lst2 = lst[:]
# print(lst)
# print(lst2)
# lst2[1] = 5555
# print(lst)
# print(lst2)




